Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: བདག་མེད་པ་ཉིད་དང་། སེམས་ཅན་མེད་པ་ཉིད་དང་། སྲོག་མེད་པ་ཉིད་དང་། གང་ཟག་མེད་པ་ཉིད་དང་། གསོ་བ་མེད་པ་ཉིད་དེ་ལྔ་པོ་དེ་དག་གོ།
en: They are the nonexistence of self, the nonexistence of a being, the nonexistence of a life principle, the nonexistence of personhood, and the nonexistence of life.

source: །ཀླུའི་བདག་པོ་ཆོས་དྲུག་གིས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: Nāga Lord, the continuity of karmic obscuration is severed by six qualities.

source: དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these six?

source: མོས་པ་དང་། ཡིད་ཆེས་པ་དང་། གཅིག་ཏུ་ངེས་པ་དང་། ཐེ་ཙོམ་མེད་པ་དང་། ཡང་དག་པ་ལ་སོ་སོར་རྟོག་པ་དང་། ལྷག་པའི་བསམ་པས་བྱ་བ་ལ་འཇུག་པ་སྟེ།
en: They are aspiration, trust, certainty, confidence, discerning the real, and engaging in actions motivated by the pure motivation.

source: ཆོས་དྲུག་པོ་དེ་དག་གིས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: These six qualities sever the continuity of karmic obscuration.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་དུ་མཆི་བ་ལགས།
en: The Blessed One said this, and Nāga King Sāgara further inquired of him, “Blessed One, how does a bodhisattva become distinguished?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་ཏེ།
en: The Blessed One answered, “Nāga Lord, bodhisattvas become distinguished if they have ten qualities.

source: དེ་ལ་མ་ཆགས་པ་དང་། ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པ་དང་། ཐབས་ལ་མཁས་པས་བརྩོན་འགྲུས་བརྟན་པ་དང་། སེམས་ཅན་ལ་ལྟ་ཞིང་སྙིང་རྗེ་ཆེ་བ་དང་། བསོད་ནམས་ལ་ཆོག་མི་ཤེས་པ་དང་། ཐོས་པ་བཙལ་བ་ལ་ཆོག་མི་ཤེས་པ་དང་། བག་ཡོད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་རྗེས་སུ་དྲན་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མངོན་སུམ་དུ་འཐོབ་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་སྟེ།
en: They are nonattachment, pure motivation, stable diligence informed by skillful means, being considerate and compassionate toward beings, being insatiable in the pursuit of merit, being insatiable in the pursuit of learning, conscientiousness, bringing the seat of awakening to mind, actualizing the wisdom of buddhahood, and never abandoning the mind set on awakening.

source: ཆོས་བཅུ་པོ་དེ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ།
en: If bodhisattvas possess these ten qualities, they will become distinguished.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པར་འགྱུར་བ་ལགས།
en: Rāhu, lord of the asuras, then asked the Blessed One, “Blessed One, how can a bodhisattva become ennobled with all virtuous qualities?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པར་འགྱུར་ཏེ།
en: The Blessed One answered, “Lord of the asuras, a bodhisattva will become ennobled with all virtuous qualities if they have eight qualities.

source: སྒྲ་གཅན་ཐེག་པ་ཆེན་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ང་རྒྱལ་མེད་པ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་ཅིང་མངོན་པར་འདུད་པ་དང་། བཀའ་བློ་བདེ་བ་ཡིན་ཏེ། འཐུན་པར་འཛིན་པ་དང་། ཇི་སྐད་སྨྲས་པ་བཞིན་བྱེད་པ་དང་། བླ་མ་རྣམས་ལ་གུས་པ་སྐྱེས་པ་དང་། དགེ་བ་སྤྱོད་པ་ཐམས་ཅད་ལ་སྔོན་དུ་འགྲོ་བ་དང་། དགེ་བའི་ཆོས་རྣམས་ལ་དམ་བཅས་པ་བརྟན་པ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡིན་ཏེ།
en: bodhisattvas in this Great Vehicle must be without pride, bow and bend before all beings, readily accept advice and be agreeable, practice what they preach, develop respect for all masters, precede all practitioners of virtue, keep firm pledges with regard to virtuous qualities, and be inspired toward vastness.

source: སྦྱིན་པ་རྣམ་པ་སྣ་ཚོགས་སྦྱིན་པ་དང་། སྲོག་གི་ཕྱིར་ཡང་གཞན་འཁྲུག་པར་མི་བྱེད་པ་དང་། གོང་དུ་ཡང་སེམས་ཅན་འཇིགས་པ་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་ཞིང་སྐྱབས་སུ་འོངས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་མི་གཏོང་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་དང་། ཆོག་མི་ཤེས་པ་སྟེ།
en: In this way, they must perform many different kinds of generosity, never upset others even at the cost of their lives, give freedom from fear to fearful beings, never abandon beings who have come for refuge, and be insatiable in the pursuit of all aspects of merit and wisdom.

source: ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: If bodhisattvas possess these eight qualities, they will become ennobled with all kinds of virtuous qualities.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་གྱིས་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་དུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཆེ་བ་ཉིད་དང་། གཟུགས་ཆེ་བ་ཉིད་དང་། འཁོར་ཆེ་བ་ཉིད་དང་། སེམས་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་ལགས།
en: Rāhu, lord of the asuras, then again asked the Blessed One, “Blessed One, through what qualities will a bodhisattva achieve greatness of body, appearance, retinue, and mind?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒྲ་གཅན་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་ལུས་ཆེ་བ་ཉིད་འཐོབ་པར་འགྱུར་ཏེ།
en: The Blessed One answered, “Rāhu, a bodhisattva will achieve greatness of body through four qualities.

source: གཞན་དག་གི་སྤྱོད་ལམ་ལ་མི་འཕྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དུ་འཇུག་པ་དང་། སེམས་ཅན་བྱེ་བ་དང་། འཐབས་པ་རྣམས་བསྡུམས་ཤིང་འཐུན་པར་བཀོད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་འཛུད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དབང་པོ་ཞེ་འགྲས་པ་མེད་པ་སྟེ།
en: They are to never belittle the behavior of others, to commission perfect representations of the Thus-Gone One’s body, to reconcile and harmonize millions of struggling beings and then establish them in unsurpassed and perfect awakening, and to be without the power of anger toward any being.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་ལུས་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: If bodhisattvas possess these four qualities, they will achieve greatness of body.

source: །ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་ཏེ།
en: “A bodhisattva will achieve greatness of appearance through four qualities.

source: རྒྱན་རྣམ་པ་སྣ་ཚོགས་སྦྱིན་པ་དང་། ཕངས་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བྱམས་པའི་མིག་གིས་ལྟ་བ་དང་། གཞན་བྱད་བཞིན་བཟང་པོ་དག་ལ་ཕྲག་དོག་དང་། སེར་སྣ་མི་བྱེད་པ་སྟེ།
en: They are to give various kinds of jewelry, to give up all valuable things, to look upon the Thus-Gone One with a loving gaze, and to not be jealous or miserly because of the fine countenance of others.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: If bodhisattvas possess these four qualities, they will achieve greatness of appearance.

source: །ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་འཁོར་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་ཏེ།
en: “A bodhisattva will achieve greatness of retinue through four qualities.

source: ཕྲ་མའི་ཚིག་སྤོང་ཞིང་གཞན་གྱི་འཁོར་མི་འབྱེད་པ་དང་། གཞན་གྱི་འཁོར་ལ་དགའ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཤིན་ཏུ་བརྟན་པ་དང་། གཞན་དག་བྱང་ཆུབ་ལ་འཛུད་པ་སྟེ།
en: They are to abandon divisive speech and to never divide another’s retinue, to rejoice in others’ retinues, to be stable in the mind set on awakening, and to establish others in awakening.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་འཁོར་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Lord of the asuras, if bodhisattvas possess these four qualities, they will achieve greatness of retinue.

source: །ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཆེ་བ་ཉིད་འཐོབ་པར་འགྱུར་ཏེ།
en: “A bodhisattva will achieve greatness of mind through four qualities.

source: བསམ་པ་དག་པ་སྟེ་གཡོ་མེད་པ་དང་། སྒྱུ་ཅན་མ་ཡིན་པ་དང་། འདུན་པ་དྲག་པོ་དང་ལྡན་པ་དང་། བར་མ་དོར་སྐྱོ་བ་མེད་པ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་ཤིང་ཐེག་པ་དམན་པ་མི་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ལ་འཇུག་པས་ཆོས་ཟབ་མོའི་ཚུལ་ལ་འཇུག་པ་སྟེ།
en: They are to have a pure motivation without deceit or pretense, to have a fierce resolve and to be unsaddened along the way, to be inspired toward vastness and to never desire the lesser vehicle, and to enter into the profound Dharma through understanding that all phenomena are inherently empty.

source: སྒྲ་གཅན་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཆེ་བ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Rāhu, if bodhisattvas possess these four qualities, they will achieve greatness of mind.”

source: །དེ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་འཁོར་སུམ་ཁྲི་ཉིས་སྟོང་དང་བཅས་པ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: Rāhu, lord of the asuras, and thirty-two thousand of his followers were pleased and delighted, overjoyed, and filled with bliss.

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་རིན་པོ་ཆེའི་མེ་ཏོག་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ་ཁལ་བཅུ་ཚད་བརྒྱས་བཅོམ་ལྡན་འདས་ལ་གཏོར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: They scattered a hundred jewel flowers set with all kinds of gems weighing hundreds of pounds toward the Blessed One and developed the mind set on unsurpassed and perfect awakening.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: At that moment, they spoke the following verses in praise of the Blessed One:

source: ཕྱོགས་བཅུ་དག་ན་སེམས་ཅན་ཁམས་རྣམས་མཐའ་ཡས་གང་སུ་དག །སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་ལ་རྒྱལ་བ་མཆོད་བྱེད་དང་། །ཕྱོགས་བཅུ་དག་ན་སེམས་ཅན་གང་དག་བསྐལ་པ་འབུམ་དུ་ཡང་།
en: “In the very same moment, point, and instant, the limitless worlds of beings Throughout the ten directions are venerating the victors. For as much as a hundred thousand eons, beings throughout the ten directions

source: །མཆོད་ལ་བརྩོན་པའི་སེམས་ཅན་དག་ནི་ཕན་པར་བྱེད་པ་དང་། །བྱམས་དང་བསོད་ནམས་འཕགས་པའི་རང་བཞིན་ལས་བྱུང་མཆོད་པ་རྣམས།
en: Who exert themselves in venerating you also bring benefit. “Such acts of veneration, drawn from love, compassion, and the nature of the noble ones,

source: །ཅི་འདྲ་བ་དང་མཚུངས་ཤིང་མཉམ་པ་མ་ལགས་ཁྱོད་ལ་འོས།
en: In whatever way and quality they are performed, are due to you, O peerless one.

source: །མཚུངས་མེད་སེམས་ཀྱིས་ཡན་ལག་གནས་ནས་བསྐྱེད་པ་གང་ལགས་པ།
en: With that which is aroused by observing the branches of practice with unparalleled intent,

source: །དེ་ནི་སྟོབས་བཅུ་ལྡན་པ་རྣམས་ལ་རྗེད་དང་མཆོད་པ་ལགས།
en: They honor and venerate those who possess the ten powers.

source: །བདག་ནི་བྱང་ཆུབ་རེག་འགྱུར་སྙམ་སྟེ་དེ་ལ་སྒྲིབ་གནས་ནས།
en: “We thought we were nearing awakening, but we were deluded.

source: །བདག་ནི་གཡོ་མེད་བྱང་ཆུབ་མཚུངས་མ་མཆིས་ལ་ཞུགས་པ་ལགས།
en: Yet we are without pretense and seek incomparable awakening.

source: །མི་དབང་ལས་བཞིན་སྲིད་གསུམ་སུ་ཡང་བདག་གི་དབང་མ་མཆིས།
en: Other than you, Lord of Humans, there is no one in the three realms who can rule us,

source: །བདག་གི་བསམ་པ་ཅི་འདྲའི་དབང་ནི་སྟོབས་བཅུ་ལྡན་པ་ལགས།
en: Because the power of our intention is that it possesses the ten powers.

source: །བདག་ནི་ཀུན་ལ་ཤིན་ཏུ་སྡུག་ཅིང་ང་རྒྱལ་བསལ་བ་དང་། །སྦྱིན་དང་དུལ་དང་ལྡན་ཞིང་ཚུལ་ཁྲིམས་ལྡན་ལ་བཟོད་ལྡན་དང་། །བརྩོན་འགྲུས་དྲན་པ་ཏིང་འཛིན་ཤེས་རབ་རྣམ་དག་གནས་པ་དང་། །བྱམས་དང་སྙིང་རྗེར་ལྡན་ཞིང་བདེན་པའི་ཆོས་ལ་སྤྱོད་གྱུར་ཅིག །ཕན་བཞེད་རྒྱལ་བ་གལ་ཏེ་བདག་ལ་ལུང་སྟོན་མི་མཛད་ཀྱང་།
en: “May we have affection for all and dispel all pride, Be possessed of giving, gentleness, discipline, and patience, Abide in diligence, mindfulness, absorption, and pure insight, Possess love and compassion, and practice the true Dharma. “Even if the altruistic victors decline to provide us with prophecy,

source: །མི་ཡི་དབང་པོ་བདག་ནི་རང་གིས་རང་ལ་ལུང་ཡང་བསྟན།
en: O Lord of Humans, we will give prophesy ourselves.

source: །བདག་ནི་རང་བྱུང་མི་འགྱུར་སྙམ་དུ་ཡིད་གཉིས་དོགས་མ་མཆིས།
en: We have no doubt about this, no worry that we cannot do this alone.

source: །དེ་ལྟར་བདག་ནི་བསམ་པ་ཐག་པས་བྱང་ཆུབ་ཉིད་སེམས་ངེས།
en: In this manner we are confident about awakening, from the depths of our hearts.”

source: །མི་དབང་འཛུམ་པ་མཛད་ནས་ཟླ་བའི་ཏོག་གིས་ཞུས་པ་ནི།
en: The Lord of Humans smiled at him, and Candraketu said,

source: །རང་བྱུང་འཛུམ་པ་མཛད་པ་འདི་ནི་ཅི་ལགས་ལུང་བསྟན་གསོལ།
en: “Self-Manifest One, what is this act of smiling? Please explain!”

source: །གང་གི་ཕྱིར་ན་ངས་ནི་དག་པའི་འོད་རྣམས་སྟོན་མཛད་པ།
en: The Teacher then said to him, “Why am I revealing this pure light?

source: །ཟླ་བའི་ཏོག་ཁྱོད་མཉན་པར་གྱིས་ཞེས་སྟོན་པས་དེ་ལ་གསུངས།
en: Candraketu, listen and I shall explain!”

source: །ལྷ་མིན་སྒྲ་གཅན་བདག་ཉིད་ཆེན་པོ་བྱང་ཆུབ་མཆོག་ལ་ཞུགས།
en: “Asura Rāhu, great being, set forth toward supreme awakening.

source: །གཡོག་འཁོར་སུམ་ཁྲི་ཉིས་སྟོང་གང་ལགས་རྣམས་ཀྱང་དེ་བཞིན་ཏེ།
en: Any of your thirty-two-thousand followers who do the same,

source: །བསྐལ་པ་སྟོང་ཕྲག་བརྒྱར་ནི་བྱང་ཆུབ་སྤྱོད་པ་སྤྱད་ནས་ཀྱང་།
en: Practicing for awakening over thousands and thousands of eons,

source: །ཐམས་ཅད་རྗེས་སུ་འཐུན་པར་བྱང་ཆུབ་གཙོ་བོ་ཐོབ་པར་འགྱུར།
en: Will thereafter achieve foremost awakening.

source: །རྒྱལ་བ་གང་གཱའི་བྱེ་མ་སྙེད་རྣམས་ལ་ནི་མཆོད་བགྱིས་ཏེ།
en: “After venerating victors as numerous as grains of sand in the Ganges

source: །དེ་ནས་སེམས་ཅན་ཤིན་ཏུ་མང་པོ་བྱང་ཆུབ་བཀོད་ནས་ཀྱང་།
en: You will then establish many beings in awakening.

source: །དེ་ཡི་འོག་ཏུ་བསྐལ་པ་དགེ་བ་བཀོད་པ་མཛེས་པ་ལ།
en: Thereafter, in the eon called Beautiful Array of Virtue,

source: །བྱང་ཆུབ་རྡུལ་བྲལ་ཞི་བ་མྱ་ངན་མེད་པར་འཚང་ཡང་རྒྱ།
en: You will achieve stainless and peaceful awakening free of anguish.

source: །སྒྲ་གཅན་བདག་ཉིད་ཆེན་པོ་འདི་ནི་ཆོས་ཀྱི་རྒྱལ་པོར་འགྱུར།
en: “Rāhu, this great being, will become a Dharma king

source: །བརྩོན་འགྲུས་སྟོབས་དང་ལྡན་ཏེ་དབང་པོའི་རྒྱལ་མཚན་ཞེས་ཀྱང་བགྱི།
en: Endowed with diligence and the powers , called Banner of the Lord.

source: །འཇིག་རྟེན་ཁམས་ཀྱང་དགའ་བ་སྐྱེད་པའི་བཀོད་པ་ཞེས་བགྱི་སྟེ།
en: Your world will be called The Array That Brings Joy,

source: །དགའ་ལྡན་གནས་དང་འདྲ་བར་འབྱོར་ཅིང་རྒྱས་ལ་ལོ་ཡང་ལེགས།
en: And it will be as rich and expansive as the Heaven of Joy, with fine harvests.

source: །སྟོབས་བཅུ་ལྡན་གྱི་ཚེ་ནི་ལོ་གྲངས་བྱེ་བ་བདུན་ཅུ་སྟེ།
en: “Your lifespan with the ten powers will be seven hundred million years.

source: །དགེ་སློང་འཕགས་པའི་དགེ་འདུན་ཁྲག་ཁྲིག་དྲུག་ཅུ་ཐམ་པར་འགྱུར།
en: You will have a noble saṅgha of monks numbering six trillion.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཁྲག་ཁྲིག་ཕྲག་བཅུ་བརྒྱད་ཅུ་སྟེ།
en: The bodhisattva saṅgha will be one trillion eight hundred billion—

source: །ཐོས་པ་དང་ནི་འདུལ་བ་འཛིན་པ་གཟུངས་ལ་ཤིན་ཏུ་གནས།
en: They will abide in learning, precepts, and dhāraṇī.

source: །བསྐལ་པ་དགེ་བ་བཀོད་པ་ཞེས་བགྱི་མཛེས་པ་དེ་དག་ཏུ།
en: “In the age of the Beautiful Array of Virtue,

source: །སེམས་ཅན་བརྒྱ་སྟོང་དག་ནི་བྱང་ཆུབ་བཀོད་པ་བགྱིས་ནས་ཀྱང་།
en: Having successfully established thousands in the mind set on awakening,

source: །འདི་དག་ཐམས་ཅད་རིམ་གྱིས་བྱང་ཆུབ་མཆོག་ཏུ་འཚང་ཡང་རྒྱ།
en: Those beings will all gradually awaken to supreme buddhahood.

source: །བྱང་ཆུབ་སེམས་མཆོག་གི་ནི་ཡོན་ཏན་ཁྱད་པར་དག་ལ་ལྟོས།
en: So consider these unique qualities of the supreme mind set on awakening.”

source: །དེར་ནི་སྒྲ་གཅན་བཟང་པོ་ལུང་བསྟན་ཐོས་པར་གྱུར་ནས་ཀྱང་། །སྲོག་ཆགས་འབུམ་ཕྲག་བཞི་དག་བྱང་ཆུབ་མཆོག་ལ་ཞུགས་པར་གྱུར།
en: Not only did the excellent Rāhu receive his prophecy, but four hundred thousand beings set forth toward supreme awakening.

source: །ལེགས་པར་ཡོན་ཏན་འཆང་བ་རྣམས་ཀྱི་བསམ་པའི་ཁྱད་པར་གྱིས། །སྟོང་གསུམ་རབ་གཡོས་ལྷས་ཀྱང་མེ་ཏོག་ཆར་པ་རབ་ཏུ་ཕབ།
en: The extraordinary intention of these beings with their excellent qualities shook the trichiliocosm, and the gods cast down a rain of flowers.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་བདག་མ་མཆིས་པ་བྱེད་པ་པོ་མ་མཆིས་པ་ལགས་ན། ལུང་བསྟན་པ་ནི་གང་ལགས།
en: Nāga King Anavatapta then asked the Blessed One, “Blessed One, if all phenomena are without self and without creator, what is a prophecy?

source: དེ་བཞིན་གཤེགས་པ་ནི་གང་ལགས།
en: What is a thus-gone one?

source: བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ནི་གང་ལགས།
en: What is awakening fully to buddhahood?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་དེ་དེ་བཞིན་ཏེ། ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པ། བྱེད་པ་པོ་མེད་པ་ཡིན་ཏེ།
en: The Blessed One answered, “Nāga Lord, all phenomena are without self and without creator.

source: དེ་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཡིན་མོད་ཀྱི།
en: This is the reality of phenomena.

source: འོན་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཕྱིན་ཅི་ལོག་དང་ལྡན་པ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་གནས་པ་རྣམས་སེམས་ཅན་མེད་པ་དག་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དེ།
en: However, childish ordinary beings who are mistaken, who are fixated in clinging to me and mine , develop the notion that there is a being where there is none.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ནས་ཕྱིན་ཅི་ལོག་གི་འདུ་ཤེས་སྤོང་དུ་གཞུག་པ་དང་། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཏུ་གོ་ཆ་གྱོན་པར་ཟད་ཀྱི་སྐྱེས་བུ་དམ་པ་དེ་དག་གིས།
en: Bodhisattvas arouse great compassion for them. For beings to then abandon such mistaken notions and become aware of how they cling to me and mine , the bodhisattvas don the armor of awakening.

source: སེམས་ཅན་མེད་པ་དང་། གང་ཟག་མེད་པ་མི་ཤེས་པ་ནི་མ་ཡིན་ཏེ། བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་ཏུ་ལྟ་བའི་སེམས་ཅན་དེ་དག་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ།
en: Such sublime beings also do not leave others in the ignorance of selflessness and nonindividuality but liberate these beings who have the views of self, being, life force, soul, person, and individual.

source: །ཀླུའི་བདག་པོ་ཁྱོད་འདི་སྐད་དུ་འདི་ལ་ལུང་བསྟན་ནས་གཤེགས་ཞེས་ཟེར་བ་གང་ཡིན་པ་དེ་ལ་མངོན་སུམ་དུ་ཆོས་ཁོང་དུ་ཆུད་པ་ནི་ལུང་བསྟན་པའོ།
en: “Nāga Lord, what you have just asked regarding prophecy is itself a prophetic teaching that shows a clear understanding of the Dharma.

source: །སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པ་དེ་ལ་སེམས་ངེས་པར་སེམས་པའི་སེམས་དང་ལྡན་པར་ལུང་བསྟན་པའོ།
en: Developing certainty about the absence of self, life force, soul, and individuality is a prophetic teaching.

source: །མ་བྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། རྩ་བ་མེད་པ་དང་། གནས་མེད་པ་ལ་གནས་པ་ནི་ལུང་བསྟན་པའོ།
en: Abiding in the nonarising, unborn, rootless, and groundless is a prophetic teaching.

source: །སེམས་ཅན་ཐམས་ཅད་མཚུངས་པར་བདག་མེད་པ་ལ་མོས་པ་ནི་ལུང་བསྟན་པའོ།
en: Interest in the fact that all beings are equally selfless is a prophetic teaching.

source: །ཆོས་ཐམས་ཅད་མཚུངས་པར་ཆོས་དབེན་པར་མཐོང་བ་ནི་ལུང་བསྟན་པའོ།
en: Seeing all phenomena as equally devoid of phenomena is a prophetic teaching.

source: །ཞིང་ཐམས་ཅད་ཞིང་དུ་མཚུངས་པར་ནམ་མཁའ་བཞིན་དུ་དག་ཅིང་དྲི་མ་མེད་པའི་སེམས་དང་ལྡན་པ་ནི་ལུང་བསྟན་པའོ།
en: Knowing that all fields are equal in being pure and immaculate like space is a prophetic teaching.

source: །ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་དང་ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ནི་ལུང་བསྟན་པའོ། །བདུད་ཐམས་ཅད་དང་མཚུངས་པར་བདུད་ཀྱི་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་མི་འགྱུར་ཏེ། རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་སེམས་དང་ལྡན་པ་ནི་ལུང་བསྟན་པའོ།
en: Seeing the wisdom that all phenomena are indivisible from the qualities of buddhahood and the realm of reality is a prophetic teaching. The mind that is naturally pure and that cannot become afflicted by any māras of affliction whatsoever is a prophetic teaching.

source: །སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་ལ་མི་རྟོག་པར་རྣམ་པར་མི་རྟོག་ལ་མི་ལེན་མི་འདོར་བ་ནི་ལུང་བསྟན་པའོ།
en: Neither accepting, giving up, thinking of, nor conceptualizing emptiness and the absence of marks is a prophetic teaching.

source: །ཀླུའི་བདག་པོ་དེ་ལྟར་ན་སེམས་དང་། ཡིད་དང་རྣམ་པར་ཤེས་པ་མི་གནས་པ་ལུང་བསྟན་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ་དམིགས་སུ་མེད་དོ། །ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ།
en: Nāga Lord, in the same manner that the nonabiding nature of mind, cognition, and consciousness is taught, so are all phenomena beyond apprehending.

source: ཁོང་དུ་ཆུད་པ་ནི་བྱང་ཆུབ་ཡིན་ཏེ།
en: Realizing the sameness of all phenomena accurately is awakening.

source: དེ་ལ་དོན་དམ་པར་ན་གང་གི་ལུང་བསྟན་པའམ། གང་གི་བྱང་ཆུབ་འམ། གང་ལུང་བསྟན་པར་བྱ་བའམ། གང་གིས་ལུང་བསྟན་པའམ། ཅིས་ལུང་བསྟན་པ་ཅི་ཡང་མི་དམིགས་སོ།
en: In this regard, on the ultimate level, there is no observation of a prophecy, an awakening, people being given a prophecy a prophet, or a reason for prophecy.

source: །ཀླུའི་བདག་པོ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Nāga Lord, why is this?

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པ་སྟེ། རྩ་བ་རྣམས་ཡོངས་སུ་ཆད་པའི་ཕྱིར་རོ།
en: Phenomena are not entities because all roots are severed.

source: །ཆོས་ཐམས་ཅད་ནི་བདག་པོ་མེད་པ་སྟེ། རྒྱུ་དང་རྐྱེན་རྣམས་ལས་འབྱུང་བའི་ཕྱིར་རོ།
en: Phenomena have no self because they arise from causes and conditions.

source: །ཆོས་ཐམས་ཅད་ནི་གཟུང་དུ་མེད་པ་སྟེ། ངོ་བོ་ཉིད་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Phenomena are ungraspable because they have the characteristic of lacking an essential nature.

source: །ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པ་སྟེ། བྲལ་བ་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Phenomena have no essential nature because they have the characteristic of being free from parting.

source: །ཆོས་ཐམས་ཅད་ནི་མ་འོངས་པ་སྟེ། སྔོན་གྱི་མཐའ་ནས་མ་འཕོས་པའི་ཕྱིར་རོ།
en: Phenomena do not arrive because they do not transfer over from the past.

source: །ཆོས་ཐམས་ཅད་ནི་མེད་པར་གྱུར་པ་སྟེ། ཕྱི་མའི་མཐར་མི་འབྱུང་བའི་ཕྱིར་རོ།
en: Phenomena are not existent because they will not come into being in the future.

source: །ཆོས་ཐམས་ཅད་ནི་མི་གནས་པ་སྟེ། གནས་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Phenomena do not abide because a location cannot be observed.

source: །ཆོས་ཐམས་ཅད་ནི་མི་དམིགས་པ་སྟེ། བྱེད་པ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena are not observable because they are nonfunctional.

source: །ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་མེད་པ་སྟེ། ལུས་མེད་པའི་ཕྱིར་རོ།
en: Phenomena are not functional because there they are incorporeal.

source: །ཆོས་ཐམས་ཅད་ནི་ལུས་མེད་པ་སྟེ། གནས་མེད་པའི་ཕྱིར་རོ།
en: Phenomena are not corporeal because they have no location.

source: །ཆོས་ཐམས་ཅད་ནི་གནས་མེད་པ་སྟེ། རྟེན་མེད་པའི་ཕྱིར་རོ།
en: Phenomena have no location because they have no support.

source: །ཆོས་ཐམས་ཅད་ནི་རྟེན་མེད་པ་སྟེ། མི་གཡོ་བའི་ཕྱིར་རོ།
en: Phenomena have no support because they do not move.

source: །ཆོས་ཐམས་ཅད་ནི་མི་གཡོ་བ་སྟེ། མི་གནས་པའི་ཕྱིར་རོ།
en: Phenomena do not move because they do not abide.

source: །ཆོས་ཐམས་ཅད་ནི་མི་གནས་པ་སྟེ། བེམས་པོ་ཡིན་པའི་ཕྱིར་རོ།
en: Phenomena do not abide because they are inanimate.

source: །ཆོས་ཐམས་ཅད་ནི་བེམས་པོ་ཡིན་ཏེ། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་རོ།
en: Phenomena are not animate because they lack essential nature.

source: །ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པ་སྟེ། རྣམ་པར་རིག་པར་མི་བྱེད་པའི་ཕྱིར་རོ།
en: Phenomena have no essential nature because they cannot be cognized.

source: །ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་རིག་པར་མི་བྱེད་པ་སྟེ། སྒྲོ་བཏགས་པ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena cannot be cognized because they are free from superimposition.

source: །ཆོས་ཐམས་ཅད་ནི་སྒྲོ་བཏགས་པ་མེད་པ་སྟེ། ཡིད་ལ་བྱེད་པ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena have no superimposition because they cannot be brought to mind.

source: །ཆོས་ཐམས་ཅད་ནི་ཡིད་ལ་བྱེད་པ་མེད་པ་སྟེ། དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena cannot be brought to mind because they are unobservable.

source: །ཆོས་ཐམས་ཅད་ནི་དམིགས་སུ་མེད་པ་སྟེ། འགྱུར་བ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena are unobservable because they do not change.

source: །ཆོས་ཐམས་ཅད་ནི་འགྱུར་བ་མེད་པ་སྟེ། རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཕྱིར་རོ།
en: Phenomena do not change because they are without concept or investigation.

source: །ཆོས་ཐམས་ཅད་ནི་རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པ་སྟེ།
en: Phenomena have no concept or investigation because they are at peace.

source: ཞི་བའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་ཞི་ཞིང་རབ་ཏུ་ཞི་ལ་ཉེ་བར་ཞི་བ་སྟེ། རྒྱུ་ལས་བྱུང་བ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: All phenomena are at peace, peaceful, and utterly peaceful because they do not occur from causes.

source: །ཆོས་ཐམས་ཅད་ནི་རྒྱུ་ལས་བྱུང་བ་མ་ཡིན་པ་སྟེ།
en: Phenomena do not occur from causes because they are inherently liberated.

source: རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བ་སྟེ།
en: All phenomena are inherently liberated because they have the characteristic of liberation.

source: རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དེ།
en: All phenomena have the characteristic of liberation because they are free of duality.

source: གཉིས་དང་བྲལ་བའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་གཉིས་དང་བྲལ་བ་སྟེ། བགྲོད་པ་གཅིག་པའི་ཕྱིར་རོ།
en: All phenomena are free from duality because they have a single mode of being.

source: །ཆོས་ཐམས་ཅད་ནི་བགྲོད་པ་གཅིག་པ་སྟེ།
en: All phenomena have a single mode of being because they are free of individuation.

source: སོ་སོ་ཐ་དད་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ནི་སོ་སོ་ཐ་དད་པ་དང་བྲལ་བ་སྟེ། བྱེ་བྲག་མེད་པའི་ཕྱིར་རོ།
en: All phenomena are free of individuation because they are without subdivisions.
